In [2]:
import pandas as pd
df=pd.DataFrame({"Students":["Ram","Suresh","Ramesh","Joe","Monica"],"Marks":[90,67,89,24,98]})
df

  Students  Marks
0      Ram     90
1   Suresh     67
2   Ramesh     89
3      Joe     24
4   Monica     98

In [5]:
type(df["Students"])

pandas.core.series.Series

In [6]:
df["Students"]

0       Ram
1    Suresh
2    Ramesh
3       Joe
4    Monica
Name: Students, dtype: object

In [8]:
df["Extra Cirricular"]=["Y","N","Y","N","Y"]

In [9]:
df

  Students  Marks Extra Cirricular
0      Ram     90                Y
1   Suresh     67                N
2   Ramesh     89                Y
3      Joe     24                N
4   Monica     98                Y

In [13]:
df[df["Extra Cirricular"]=="N"]

  Students  Marks Extra Cirricular
1   Suresh     67                N
3      Joe     24                N

In [17]:
df.drop("Extra Cirricular",axis=1)

  Students  Marks
0      Ram     90
1   Suresh     67
2   Ramesh     89
3      Joe     24
4   Monica     98

In [18]:
df.drop(df.index[[1,2]])

  Students  Marks Extra Cirricular
0      Ram     90                Y
3      Joe     24                N
4   Monica     98                Y

In [21]:
df.drop(df.columns[[0,2]],axis=1)

   Marks
0     90
1     67
2     89
3     24
4     98